{
  "stoi": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<CLS>": 2,
    "DUR_1": 3,
    "VEL_6": 4,
    "DUR_2": 5,
    "VEL_7": 6,
    "TS_1": 7,
    "VEL_5": 8,
    "DUR_4": 9,
    "VEL_4": 10,
    "PITCH_38": 11,
    "PITCH_36": 12,
    "PITCH_33": 13,
    "DUR_8": 14,
    "TS_2": 15,
    "PITCH_31": 16,
    "PITCH_40": 17,
    "PITCH_43": 18,
    "PITCH_35": 19,
    "PITCH_28": 20,
    "VEL_3": 21,
    "PITCH_34": 22,
    "PITCH_41": 23,
    "PITCH_45": 24,
    "PITCH_29": 25,
    "PITCH_37": 26,
    "PITCH_39": 27,
    "PITCH_32": 28,
    "PITCH_30": 29,
    "PITCH_42": 30,
    "PITCH_48": 31,
    "PITCH_50": 32,
    "TS_3": 33,
    "PITCH_47": 34,
    "DUR_16": 35,
    "PITCH_46": 36,
    "PITCH_44": 37,
    "PITCH_52": 38,
    "VEL_2": 39,
    "PITCH_55": 40,
    "PITCH_26": 41,
    "PITCH_53": 42,
    "PITCH_57": 43,
    "PITCH_49": 44,
    "TS_4": 45,
    "PITCH_27": 46,
    "PITCH_51": 47,
    "PITCH_54": 48,
    "PITCH_60": 49,
    "TS_5": 50,
    "PITCH_62": 51,
    "PITCH_59": 52,
    "PITCH_56": 53,
    "PITCH_24": 54,
    "VEL_1": 55,
    "PITCH_58": 56,
    "DUR_32": 57,
    "PITCH_25": 58,
    "TS_6": 59,
    "TS_32": 60,
    "PITCH_64": 61,
    "PITCH_61": 62,
    "PITCH_67": 63,
    "PITCH_65": 64,
    "PITCH_66": 65,
    "TS_7": 66,
    "PITCH_63": 67,
    "TS_8": 68,
    "PITCH_69": 69,
    "PITCH_23": 70,
    "PITCH_21": 71,
    "VEL_0": 72,
    "TS_9": 73,
    "PITCH_72": 74,
    "PITCH_74": 75,
    "PITCH_22": 76,
    "TS_10": 77,
    "PITCH_71": 78,
    "PITCH_70": 79,
    "TS_12": 80,
    "PITCH_68": 81,
    "PITCH_76": 82,
    "TS_11": 83,
    "<TEMPO_120_139>": 84,
    "TS_14": 85,
    "TS_13": 86,
    "DUR_64": 87,
    "TS_16": 88,
    "PITCH_73": 89,
    "<TEMPO_100_119>": 90,
    "PITCH_77": 91,
    "<TEMPO_80_99>": 92,
    "TS_15": 93,
    "PITCH_75": 94,
    "PITCH_20": 95,
    "<TEMPO_140P>": 96,
    "PITCH_19": 97,
    "PITCH_79": 98,
    "PITCH_78": 99,
    "TS_17": 100,
    "PITCH_16": 101,
    "<TEMPO_SLOW>": 102,
    "PITCH_81": 103,
    "PITCH_83": 104,
    "<KEY_C>": 105,
    "TS_18": 106,
    "PITCH_84": 107,
    "<KEY_G>": 108,
    "<KEY_D>": 109,
    "TS_20": 110,
    "TS_24": 111,
    "<KEY_F>": 112,
    "TS_28": 113,
    "PITCH_18": 114,
    "TS_19": 115,
    "TS_30": 116,
    "PITCH_0": 117,
    "<KEY_A>": 118,
    "<KEY_Am>": 119,
    "PITCH_80": 120,
    "TS_22": 121,
    "TS_26": 122,
    "<KEY_Em>": 123,
    "TS_23": 124,
    "<KEY_Dm>": 125,
    "TS_25": 126,
    "TS_29": 127,
    "DUR_128": 128,
    "TS_21": 129,
    "<KEY_Bb>": 130,
    "<KEY_E>": 131,
    "TS_31": 132,
    "PITCH_17": 133,
    "<KEY_Eb>": 134,
    "TS_27": 135,
    "<KEY_Cm>": 136,
    "<KEY_Gm>": 137,
    "<KEY_Bm>": 138,
    "<KEY_Ab>": 139,
    "<KEY_Fm>": 140,
    "PITCH_87": 141,
    "PITCH_82": 142,
    "PITCH_86": 143,
    "<KEY_B>": 144,
    "PITCH_85": 145,
    "PITCH_15": 146,
    "<KEY_Bbm>": 147,
    "PITCH_11": 148,
    "PITCH_88": 149,
    "PITCH_5": 150,
    "DUR_256": 151,
    "<KEY_Ebm>": 152,
    "PITCH_89": 153,
    "PITCH_93": 154,
    "PITCH_13": 155,
    "PITCH_12": 156,
    "PITCH_91": 157,
    "DUR_512": 158,
    "PITCH_9": 159,
    "PITCH_10": 160,
    "PITCH_95": 161,
    "PITCH_8": 162,
    "PITCH_94": 163,
    "PITCH_14": 164,
    "PITCH_114": 165,
    "PITCH_4": 166,
    "PITCH_7": 167,
    "PITCH_2": 168,
    "PITCH_90": 169,
    "PITCH_3": 170,
    "PITCH_96": 171,
    "DUR_1024": 172,
    "PITCH_6": 173,
    "PITCH_98": 174,
    "PITCH_102": 175,
    "PITCH_107": 176,
    "PITCH_92": 177,
    "PITCH_1": 178,
    "DUR_2048": 179,
    "PITCH_103": 180,
    "PITCH_108": 181,
    "PITCH_100": 182,
    "PITCH_105": 183,
    "PITCH_97": 184,
    "PITCH_113": 185,
    "PITCH_115": 186,
    "PITCH_111": 187,
    "PITCH_110": 188
  },
  "itos": [
    "<PAD>",
    "<UNK>",
    "<CLS>",
    "DUR_1",
    "VEL_6",
    "DUR_2",
    "VEL_7",
    "TS_1",
    "VEL_5",
    "DUR_4",
    "VEL_4",
    "PITCH_38",
    "PITCH_36",
    "PITCH_33",
    "DUR_8",
    "TS_2",
    "PITCH_31",
    "PITCH_40",
    "PITCH_43",
    "PITCH_35",
    "PITCH_28",
    "VEL_3",
    "PITCH_34",
    "PITCH_41",
    "PITCH_45",
    "PITCH_29",
    "PITCH_37",
    "PITCH_39",
    "PITCH_32",
    "PITCH_30",
    "PITCH_42",
    "PITCH_48",
    "PITCH_50",
    "TS_3",
    "PITCH_47",
    "DUR_16",
    "PITCH_46",
    "PITCH_44",
    "PITCH_52",
    "VEL_2",
    "PITCH_55",
    "PITCH_26",
    "PITCH_53",
    "PITCH_57",
    "PITCH_49",
    "TS_4",
    "PITCH_27",
    "PITCH_51",
    "PITCH_54",
    "PITCH_60",
    "TS_5",
    "PITCH_62",
    "PITCH_59",
    "PITCH_56",
    "PITCH_24",
    "VEL_1",
    "PITCH_58",
    "DUR_32",
    "PITCH_25",
    "TS_6",
    "TS_32",
    "PITCH_64",
    "PITCH_61",
    "PITCH_67",
    "PITCH_65",
    "PITCH_66",
    "TS_7",
    "PITCH_63",
    "TS_8",
    "PITCH_69",
    "PITCH_23",
    "PITCH_21",
    "VEL_0",
    "TS_9",
    "PITCH_72",
    "PITCH_74",
    "PITCH_22",
    "TS_10",
    "PITCH_71",
    "PITCH_70",
    "TS_12",
    "PITCH_68",
    "PITCH_76",
    "TS_11",
    "<TEMPO_120_139>",
    "TS_14",
    "TS_13",
    "DUR_64",
    "TS_16",
    "PITCH_73",
    "<TEMPO_100_119>",
    "PITCH_77",
    "<TEMPO_80_99>",
    "TS_15",
    "PITCH_75",
    "PITCH_20",
    "<TEMPO_140P>",
    "PITCH_19",
    "PITCH_79",
    "PITCH_78",
    "TS_17",
    "PITCH_16",
    "<TEMPO_SLOW>",
    "PITCH_81",
    "PITCH_83",
    "<KEY_C>",
    "TS_18",
    "PITCH_84",
    "<KEY_G>",
    "<KEY_D>",
    "TS_20",
    "TS_24",
    "<KEY_F>",
    "TS_28",
    "PITCH_18",
    "TS_19",
    "TS_30",
    "PITCH_0",
    "<KEY_A>",
    "<KEY_Am>",
    "PITCH_80",
    "TS_22",
    "TS_26",
    "<KEY_Em>",
    "TS_23",
    "<KEY_Dm>",
    "TS_25",
    "TS_29",
    "DUR_128",
    "TS_21",
    "<KEY_Bb>",
    "<KEY_E>",
    "TS_31",
    "PITCH_17",
    "<KEY_Eb>",
    "TS_27",
    "<KEY_Cm>",
    "<KEY_Gm>",
    "<KEY_Bm>",
    "<KEY_Ab>",
    "<KEY_Fm>",
    "PITCH_87",
    "PITCH_82",
    "PITCH_86",
    "<KEY_B>",
    "PITCH_85",
    "PITCH_15",
    "<KEY_Bbm>",
    "PITCH_11",
    "PITCH_88",
    "PITCH_5",
    "DUR_256",
    "<KEY_Ebm>",
    "PITCH_89",
    "PITCH_93",
    "PITCH_13",
    "PITCH_12",
    "PITCH_91",
    "DUR_512",
    "PITCH_9",
    "PITCH_10",
    "PITCH_95",
    "PITCH_8",
    "PITCH_94",
    "PITCH_14",
    "PITCH_114",
    "PITCH_4",
    "PITCH_7",
    "PITCH_2",
    "PITCH_90",
    "PITCH_3",
    "PITCH_96",
    "DUR_1024",
    "PITCH_6",
    "PITCH_98",
    "PITCH_102",
    "PITCH_107",
    "PITCH_92",
    "PITCH_1",
    "DUR_2048",
    "PITCH_103",
    "PITCH_108",
    "PITCH_100",
    "PITCH_105",
    "PITCH_97",
    "PITCH_113",
    "PITCH_115",
    "PITCH_111",
    "PITCH_110"
  ]
}